[
  {
    "position":"Senior Software Engineer",
    "company":"KONY INDIA PVT. LTD, HYDERABAD",
    "duration":"May 2019 – Now",
    "info":"Worked on Kony Marketplace Platform (https://marketplace.kony.com).",
    "responsibilities":[
      "Setup and managed server with 99.95% uptime. Use GIT and AWS to cutoff release time by 20%.",
      "Successfully managing Bi-weekly release in different environments.",
      "Owned and Orchestrated the complete designing and development of Code Analyzer and Code Coverage Engine for React JS, which checks for the amount of code covered in the current pull request and helps in increased product quality."
    ]
  },
  {
    "position":"Software Development Engineer",
    "company":"KONY INDIA PVT. LTD, HYDERABAD",
    "duration":"Aug 2017 – May 2019",
    "info":"Worked on Kony Marketplace Platform (https://marketplace.kony.com).",
    "responsibilities":[
      "Develop Marketplace 2.0 with optimized performance and google page insight score of 94.",
      "Also develop Private marketplace which enables the customers to view and share components only in their organization with high security",
      "Design and developed Kony Marketplace Platform for customers and community to showcase their components built inKony Visualizer",
      "Owned and Orchestrated the complete designing and development of Automation Testing Engine in java which provides a daily report for Website and APIs tests status which resulted in increased customer base and enrich product quality.",
      "Develop APIs for marketplace platform in Drupal in PHP as language."
    ]
  },
  {
    "position":"Associate Software Engineer",
    "company":"KONY INDIA PVT. LTD, HYDERABAD",
    "duration":"Aug 2016 – Aug 2017",
    "info":"Worked on Kony Web portals (https://www.kony.com & https://community.kony.com/).",
    "responsibilities":[
      "Develop responsiveness to Kony Marketplace platform (https://community.kony.com/marketplace)",
      "Develop front End of Kony Web portals",
      "Develop APIs for marketplace platform in Drupal in PHP as language.",
      "Contribute to Drupal.org community by creating a patch for the module (Fancy select)."
    ]
  }
]
